src/DataProcessors/РаботаСДокументами/РаботаСДокументами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСДокументами</name>
</mdclass:DataProcessor>

src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Catalog.Контрагенты</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказовПоставщикам</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>ДопРеквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/РаботаСДокументами/Forms/Форма/Module.bsl
&НаСервере
Процедура СоздатьДокументНаСервере()
	
	//Организация - "Электроник ООО"
	//Склад - "Основной"
	//Контрагент - "Прокси Торг ООО"
	//договор - "00020";
	//Номенклатура "Робот-пылесос Redmond RV-R650S WiFi"
	НовыйЗаказ = Документы.ЗаказПоставщику.СоздатьДокумент();
	
	//реквизиты шапки
	НовыйЗаказ.Дата = ТекущаяДата();
	НовыйЗаказ.Организация = Справочники.Организации.НайтиПоНаименованию("Электроник ООО");
	НовыйЗаказ.Склад = Справочники.Склады.НайтиПоНаименованию("Основной");
	НовыйЗаказ.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("Прокси Торг ООО");
	НовыйЗаказ.Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("00020");
	
	//табличная часть
	СтрокаТовары = НовыйЗаказ.Товары.Добавить();
	СтрокаТовары.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Робот-пылесос Redmond RV-R650S WiFi");
	СтрокаТовары.Количество = 3;
	СтрокаТовары.Цена = 1000;
	
	ИменаРеквизитов = "ЕдиницаИзмерения,СтавкаНДС";	
	РеквизитыНоменклатуры = ОбщегоНазначенияВызовСервера.ПолучитьРеквизитыНоменклатуры(СтрокаТовары.Номенклатура, ИменаРеквизитов);

	СтрокаТовары.ЕдиницаИзмерения = РеквизитыНоменклатуры.ЕдиницаИзмерения;
	СтрокаТовары.СтавкаНДС = РеквизитыНоменклатуры.СтавкаНДС;
	
	ОбработкаТабличнхЧастейСервер.РассчитатьСуммыВСтрокеТабличнойЧасти(СтрокаТовары);
	
	НовыйЗаказ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	СоздатьДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиДокументНаСервере()
	
	//Найти документ с номером "00000000005" и сообщить сумму документа
	НайденныйДокумент = Документы.ЗаказПоставщику.НайтиПоНомеру("00000000005", ТекущаяДата());
	
	Если НайденныйДокумент.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ с номером ""00000000005"" не найден";
		Сообщение.Сообщить();
	Иначе
		
		ДокументОбъект = НайденныйДокумент.ПолучитьОбъект();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сумма документа: " + ДокументОбъект.СуммаДокумента;
		Сообщение.Сообщить();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиДокумент(Команда)
	НайтиДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьДокументНаСервере()
	
	//1. найти ссылку на документ
	СсылкаНаДокумент = Документы.ЗаказПоставщику.НайтиПоНомеру("00000000009", ТекущаяДата());
	
	Если СсылкаНаДокумент.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ с номером ""00000000009"" не найден";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	//2. получить объект по ссылке
	ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	
	//3. Изменить данные объекта
	Для каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
		СтрокаТЧ.Количество = СтрокаТЧ.Количество + 1;
	    ОбработкаТабличнхЧастейСервер.РассчитатьСуммыВСтрокеТабличнойЧасти(СтрокаТЧ);
	КонецЦикла; 
	
	//4. записать документ
	ДокументОбъект.Записать();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Документ успешно изменен...";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДокумент(Команда)
	ИзменитьДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеДокументаНаСервере()
	
	//1. Найти ссылку на документ
	СсылкаНаДокумент = Документы.ЗаказПоставщику.НайтиПоНомеру("00000000009", ТекущаяДата());
	
	Если СсылкаНаДокумент.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден документ";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	//2. получить объект документа
	ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	
	НетОшибок = ДокументОбъект.ПроверитьЗаполнение();
	
	Если НетОшибок = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Есть ошибки...";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ заполнен правильно!";
		Сообщение.Сообщить();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеДокумента(Команда)
	ПроверитьЗаполнениеДокументаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииНаСервере()
	
	//1. Найти ссылку на документ-основание (заказ поставщику)
	СсылкаНаДокумент = Документы.ЗаказПоставщику.НайтиПоНомеру("00000000009", ТекущаяДата());
	
	//2. проверка на пустую ссылку
	Если СсылкаНаДокумент.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден документ";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 

	//3. Создать документ Приходная накладная
	ДокументПриход = Документы.ПриходнаяНакладная.СоздатьДокумент();
	
	//заполняем дату документа
	ДокументПриход.Дата = ТекущаяДата();
	
	//4. Инициируем событие ОбработкаЗаполнения
	ДокументПриход.Заполнить(СсылкаНаДокумент);
	
	//5. Записать документ
	ДокументПриход.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаОсновании(Команда)
	ЗаполнитьНаОснованииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьДокументыНаСервере()
	
	//выбор документов за день
	ДатаНачала = '20211104';
	ДатаОкончания = КонецДня(ДатаНачала);
	
	Выборка = Документы.ЗаказПоставщику.Выбрать(ДатаНачала, ДатаОкончания);
	Пока Выборка.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Номер: " + Выборка.Номер + ", сумма: " + Выборка.СуммаДокумента;
		Сообщение.Сообщить();			
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокументы(Команда)
	ВыбратьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументНаСервере()
	
	//1. Найти ссылку на документ-основание (заказ поставщику)
	СсылкаНаДокумент = Документы.ЗаказПоставщику.НайтиПоНомеру("00000000009", ТекущаяДата());
	
	//2. проверка на пустую ссылку
	Если СсылкаНаДокумент.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден документ";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	//3. получить объект документа
	ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	
	//4. проведение документа
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	//Попытка
	//	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//Исключение
	//	ДокументОбъект.Записать();
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Не удалось провести документ, причина: " + ОписаниеОшибки();
	//	Сообщение.Сообщить();
	//КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	ПровестиДокументНаСервере();
КонецПроцедуры
